ruby/usbapi/app/controllers/arduinos_controller.rb

  def list
    @arduinos = Arduino.all
---
SELECT "arduinos".* FROM "arduinos"

  def set_arduino
    @arduino = Arduino.all.select { |b| b.serialnumber = params[:serialnumber] }.first
---
SELECT "arduinos".* FROM "arduinos"