ruby/usbapi/app/controllers/usbs_controller.rb

SELECT "usbs".* FROM "usbs"
---
  def list
    @usbs = Usb.all